
using Microsoft.EntityFrameworkCore;
using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using DataLayer.Models;

namespace DataLayer
{
    public class DatabaseSeed
    {
        [Obsolete]
        public static void Seed(ApplicationContext context)
        {
            /*
             This approach isn't for everyone. While it's great for apps with a local database, 
             most applications will require more robust deployment strategy like generating SQL scripts.
             Don't call EnsureCreated() before Migrate(). 
             EnsureCreated() bypasses Migrations to create the schema, which causes Migrate() to fail.
             */
            context.Database.Migrate();
            context.Database.EnsureCreated();

            SsedBranches(context);
            SsedCountries(context);
            SeedGovernorates(context);
            SeedPoliceDepartments(context);
            //SeedQualification(context);
            SeedQualificationTypes(context);
            SeedReferenceItems(context);
            SeedItemsPricing(context);
            SeedBankCodes(context);
            SeedQualificationVsWPCode(context);
            SeedIStates(context);
            SeedGenders(context);
            SeedReligions(context);
            SeedStats(context);
            SeedJobsInEgypt(context);
            SeedContractDescriptionTypes(context);
            SeedJobTypes(context);
            SeedFinancialClearanceType(context);

        }

        [Obsolete]
        private static void SeedJobTypes(ApplicationContext context)
        {
            if (context.JobTypes.Count() == 0)
            {
                context.Database.ExecuteSqlRaw(@"

                SET IDENTITY_INSERT JobTypes ON

               INSERT INTO [JobTypes] ([Id], [Code], [Name]) VALUES
	('1','2747', N'مولده'),
	('2','2748', N'مونتاج'),
	('3','2776', N'نائب رئيس محكمه النقض'),
	('4','2779', N'نائب مدير'),
	('5','2782', N'ناسخ'),
	('6','2783', N'ناسخ الة'),
	('7','2785', N'ناسخ اله كاتبه'),
	('8','2787', N'ناظر'),
	('9','2789', N'ناظر مدرسه'),
	('10','2730', N'موظفة'),
	('11','2610', N'مهندسة زراعية'),
	('12','2614', N'مهندسه'),
	('13','2615', N'مهندسة كهرباء'),
	('14','2616', N'مهندسه مدنيه'),
	('15','2618', N'مهنى'),
	('16','2622', N'موجه'),
	('17','2630', N'موجهه'),
	('18','2633', N'موزع'),
	('19','2636', N'موسيقى'),
	('20','2650', N'موظف بدوله اجنبيه'),
	('21','2537', N'مهندس اجهزه طبيه'),
	('22','2539', N'مهندس استشارى'),
	('23','2543', N'مهندس الكترونيات'),
	('24','2545', N'مهندس انتاج'),
	('25','2546', N'مهندس انشائى'),
	('26','2555', N'مهندس بحرى'),
	('27','2560', N'مهندس تبريد وتكييف'),
	('28','2563', N'مهندس تصميم'),
	('29','2566', N'مهندس تنفيذ'),
	('30','2570', N'مهندس ديكور'),
	('31','2579', N'مهندس صيانة'),
	('32','2582', N'مهندس كمبيوتر'),
	('33','2592', N'مهندس مساحه'),
	('34','2595', N'مهندس مصاعد'),
	('35','2599', N'مهندس مناجم'),
	('36','2466', N'ممرضة'),
	('37','2474', N'ممثل تجارى'),
	('38','2476', N'مناول طعام'),
	('39','2484', N'مندوب'),
	('40','2486', N'مندوب دعايه واعلان'),
	('41','2488', N'مندوب تجارى'),
	('42','2495', N'مندوب عام'),
	('43','2498', N'مندوب علاقات عامه'),
	('44','2505', N'مندوب مشتريات'),
	('45','2507', N'منسق حدائق'),
	('46','2508', N'منسق زهور'),
	('47','2509', N'منسق عقود'),
	('48','2510', N'منسق ومحضر الاكل'),
	('49','2511', N'منشد'),
	('50','2512', N'سماك'),
	('51','2513', N'منفذ ديكور'),
	('52','2514', N'منفذ ماكيت'),
	('53','2520', N'مهندس'),
	('54','2522', N'مهندس  بترول'),
	('55','2525', N'مهندس  زراعى'),
	('56','2532', N'مهندس  معمارى'),
	('57','2533', N'مهندس  ميكانيكا'),
	('58','2534', N'مهندس اتصالات'),
	('59','2384', N'معيد بالجامعه'),
	('60','2385', N'معيده'),
	('61','2389', N'مفتش'),
	('62','2404', N'مفتش عمل'),
	('63','2405', N'مفتش مالى'),
	('64','2407', N'مفتش مبانى'),
	('65','2408', N'مفتشه'),
	('66','2413', N'مقاول'),
	('67','2418', N'مقدمة طعام'),
	('68','2419', N'مقدمه برامج'),
	('69','2424', N'ميكانيكى'),
	('70','2431', N'مكوجى'),
	('71','2433', N'ملاحظ معمارى'),
	('72','2434', N'ملاح  جوى'),
	('73','2435', N'ملاحظ'),
	('74','2454', N'ملبس'),
	('75','2455', N'ملحق اعلانى'),
	('76','2460', N'ممثل'),
	('77','2298', N'مشغل محطه'),
	('78','2299', N'مشغل معدات'),
	('79','2300', N'مشغل نظام الطاقة'),
	('80','2301', N'مشغل ورديه'),
	('81','2303', N'مشغله العاب'),
	('82','2306', N'مصرفى'),
	('83','2317', N'مصلح اسلحه'),
	('84','2318', N'مصلح اطارات'),
	('85','2319', N'مصلح ستائر'),
	('86','2320', N'مصمم اثاث'),
	('87','2321', N'مصمم اعلان'),
	('88','2322', N'مصمم داخلى'),
	('89','2323', N'مصمم ديكور'),
	('90','2324', N'مصمم شنط'),
	('91','2325', N'مصمم ماكيت'),
	('92','2326', N'مصمم موديلات'),
	('93','2327', N'مصممه اعلانات'),
	('94','2328', N'مصممه اكسسورات'),
	('95','2329', N'مصور'),
	('96','2330', N'مصور اوفست'),
	('97','2331', N'مصور تليفزيونى'),
	('98','2332', N'مصور سينمائى'),
	('99','2333', N'مصور صحفى'),
	('100','2335', N'مصور مونتاج'),
	('101','2337', N'مصور ومخرج'),
	('102','2338', N'مصوره'),
	('103','2339', N'مضيف'),
	('104','2345', N'مضيفة'),
	('105','2350', N'مطبعجى'),
	('106','2352', N'مطرزة'),
	('107','2355', N'معاون'),
	('108','2357', N'معاون انتاج'),
	('109','2358', N'معاون بيطرى'),
	('110','2359', N'معاون تليفون'),
	('111','2361', N'معاون خدمه'),
	('112','2363', N'معاون مجزر'),
	('113','2366', N'معقب قضايا'),
	('114','2371', N'معلم دفاع جوى'),
	('115','2381', N'معاون فنى'),
	('116','2382', N'معيد'),
	('117','2227', N'مشرف تشغيل'),
	('118','2229', N'مشرف تغذية'),
	('119','2232', N'مشرف تنفيذ'),
	('120','2233', N'مشرف ثقافى'),
	('121','2234', N'مشرف حفريات'),
	('122','2235', N'مشرف خدمات'),
	('123','2236', N'مشرف رياضى'),
	('124','2237', N'مشرف زراعى'),
	('125','2238', N'مشرف سكن'),
	('126','2240', N'مشرف شحن'),
	('127','2245', N'مشرف عمليات'),
	('128','2246', N'مشرف غرف'),
	('129','2247', N'مشرف فنى'),
	('130','2254', N'مشرف كهرباء'),
	('131','2257', N'مشرف مبانى'),
	('132','2260', N'مشرف مطعم'),
	('133','2269', N'مشرفة اجتماعية'),
	('134','2274', N'مشرفة طيران'),
	('135','2276', N'مشرفه'),
	('136','2277', N'مشرفه اسكان'),
	('137','2278', N'مشرفه تربيه'),
	('138','2280', N'مشرفه تمريض'),
	('139','2281', N'مشرفه منزل'),
	('140','2282', N'مشغل'),
	('141','2283', N'مشغل اجهزة'),
	('142','2289', N'مشغل العاب'),
	('143','2292', N'مشغل تليفون'),
	('144','2294', N'مشغل حاسب الى'),
	('145','2295', N'مشغل سنترال'),
	('146','2297', N'مشغل ماكينات'),
	('147','2147', N'مساعد باحث'),
	('148','2150', N'مساعد حلوانى'),
	('149','2157', N'مساعد صيدلى'),
	('150','2158', N'مساعد طاهى'),
	('151','2161', N'مساعد طحان'),
	('152','2162', N'مساعد عمليات'),
	('153',  '2163', N'مساعد فندقى'),
	('154','2166', N'مساعد كابتن مطعم'),
	('155','2170', N'مساعد محاسب'),
	('156','2171', N'مساعد مدير'),
	('157','2176', N'مساعد مراقب'),
	('158','2181', N'مساعد مهندس'),
	('159','2182', N'مساعد مهندس زراعى'),
	('160','2186', N'مساعد وزير داخليه سابقا'),
	('161','2188', N'مساعده ممرضه'),
	('162','2191', N'مساعده اداريه'),
	('163','2195', N'مستشار'),
	('164','2197', N'مستشار بمجلس الدوله'),
	('165','2198', N'مستشار بمحكمه استئناف القاهره'),
	('166','2199', N'مستشار بوزاره العدل'),
	('167','2200', N'مستشار رئيس محكمه'),
	('168','2201', N'مستشار قانونى'),
	('169','2202', N'مستشار محكمة النقض'),
	('170','2204', N'مستشار نظم المعلومات'),
	('171','2205', N'مسجل'),
	('172','2208', N'مسجل حسابات'),
	('173','2210', N'مسعف'),
	('174','2212', N'مسوق'),
	('175','2213', N'مشرف'),
	('176','2214', N'مشرف اجتماعى'),
	('177','2216', N'مشرف ادوار'),
	('178','2219', N'مشرف اغذيه'),
	('179','2221', N'مشرف انتاج'),
	('180','2074', N'مراقب حسابات'),
	('181','2076', N'مراقب زراعى'),
	('182','2079', N'مراقب صحى'),
	('183','2081', N'مراقب عام'),
	('184','2097', N'مراقب نص قرانى'),
	('185','2098', N'مراقبه'),
	('186','2099', N'مربية'),
	('187','2102', N'مرحل'),
	('188','2104', N'مرشد دينى'),
	('189','2105', N'مرشد سياحى'),
	('190','2106', N'مرشد نحل'),
	('191','2112', N'مزارع'),
	('192','2118', N'مسئول ائتمان'),
	('193','2120', N'مسئول ادارى'),
	('194','2121', N'مسئول الاعلام والعلاقات العامة'),
	('195','2122', N'مسئول امن'),
	('196','2123', N'مسئول تسهيلات'),
	('197','2125', N'مسئول حسابات'),
	('198','2126', N'مسئول خدمه ممتاز'),
	('199','2127', N'مسئول علاقات عامه'),
	('200','2128', N'مسئول فرع'),
	('201','2130', N'مسئول مبيعات'),
	('202','2132', N'مسئول مشتريات'),
	('203','2133', N'مسئول معرض'),
	('204','2134', N'مسئوله محل'),
	('205','2135', N'مساح'),
	('206','2141', N'مساعد'),
	('207','2142', N'مساعد اخصائى جراحة عامة'),
	('208','2144', N'مساعد الخدمات الاداريه'),
	('209','2146', N'مساعد شرطه'),
	('210','2003', N'مدير مدرسه'),
	('211','2006', N'مدير مشتريات'),
	('212','2010', N'مدير مطعم'),
	('213','2018', N'مدير نيابه'),
	('214','2024', N'مديرة موسسة'),
	('215','2026', N'مديره اداره'),
	('216','2028', N'مديره التوجيه'),
	('217','2029', N'مديره مدرسه'),
	('218','2030', N'مذهباتى'),
	('219','2031', N'مذيع مقدم برامج'),
	('220','2032', N'مذيعة'),
	('221','2033', N'مذيعه مقدمه برامج'),
	('222','2034', N'مذيعه ومحرره بالتليفزيون'),
	('223','2035', N'مراجع'),
	('224','2049', N'مراجع لغوى'),
	('225','2052', N'مراسلة'),
	('226','2054', N'مراقب'),
	('227','1939', N'مدير استوديو'),
	('228','1940', N'مدير استيراد وتصدير'),
	('229','1951', N'مدير الشئون المالية والادارية'),
	('230','1960', N'مدير تجارى'),
	('231','1961', N'مدير تخطيط'),
	('232','1962', N'مدير تدريب'),
	('233','1963', N'مدير تسويق'),
	('234','1965', N'مدير تصوير سينمائى'),
	('235','1974', N'مدير حفلات'),
	('236','1982', N'مدير صيانه'),
	('237','1987', N'مدير علاقات عامه'),
	('238','1994', N'مدير مؤسسه تجاريه'),
	('239','1995', N'مدير مالى'),
	('240','1897', N'مدرسه'),
	('241','1917', N'مدرسه تمريض'),
	('242','1927', N'مدقق حسابات'),
	('243','1928', N'مدير ادارى'),
	('244','1793', N'محلل نظم ومبرمج كومبيوتر'),
	('245','1796', N'مختبر كيميائى'),
	('246','1797', N'مختبر معدات'),
	('247','1798', N'مخرج'),
	('248','1799', N'مخرج اعلانات'),
	('249','1800', N'مخرج صحفى'),
	('250','1801', N'مخرج فنى'),
	('251','1802', N'مخرجة تليفزيون'),
	('252','1804', N'مخطط'),
	('253','1808', N'مخطط برامج ومحلل نظم'),
	('254','1811', N'مخلص'),
	('255','1812', N'مخلص جمارك'),
	('256','1814', N'مدخل بيانات'),
	('257','1816', N'مدخله بيانات'),
	('258',  '1819', N'مدرب اطفاء'),
	('259',  '1828', N'مدرب رياضى'),
	('260',  '1832', N'مدرب فنى'),
	('261',  '1840', N'مدرب موسيقى'),
	('262',  '1855', N'مدرس بالجامعه'),
	('263',  '1751', N'محاسبة'),
	('264',  '1755', N'محاضر'),
	('265',  '1756', N'محاضرة'),
	('266',  '1759', N'محامى'),
	('267',  '1764', N'محاميه'),
	('268',  '1765', N'محرر'),
	('269',  '1766', N'محرر صحفى'),
	('270',  '1767', N'محرر فى مجمع اللغه العربيه'),
	('271',  '1768', N'محرر مراجع'),
	('272',  '1769', N'محرر/ مراسل'),
	('273',  '1770', N'محصل'),
	('274',  '1773', N'محضر'),
	('275',  '1774', N'محضر اول علوم'),
	('276',  '1775', N'محضر طلبات رابع'),
	('277',  '1776', N'محضر علوم'),
	('278',  '1777', N'محضر مختبر'),
	('279',  '1778', N'محضره مختبر'),
	('280',  '1779', N'محقق'),
	('281',  '1780', N'محقق شرطى'),
	('282',  '1783', N'محلل اعمال مصرفيه'),
	('283',  '1785', N'محلل مالى'),
	('284',  '1787', N'محلل مختبر'),
	('285',  '1788', N'محلل نظم'),
	('286',  '1649', N'مؤذن ومقيم شعائر'),
	('287',  '1651', N'ماذون شرعى'),
	('288',  '1653', N'مامور استقبال'),
	('289',  '1654', N'مامور تنفيذ احكام'),
	('290',  '1655', N'مامور جمارك'),
	('291',  '1657', N'مامور حجز تذاكر طيران'),
	('292',  '1658', N'مامور سنترال'),
	('293',  '1659', N'مامور ضرائب'),
	('294',  '1660', N'مامور علاقات عامة'),
	('295',  '1662', N'مامور مستودع'),
	('296',  '1664', N'مباشر'),
	('297',  '1670', N'مبرمج كومبيوتر'),
	('298',  '1676', N'مبكانيكى مصاعد'),
	('299',  '1677', N'مبلط قيشانى'),
	('300',  '1678', N'مبلط'),
	('301',  '1691', N'مبيض معمارى'),
	('302',  '1700', N'مترجم'),
	('303',  '1703', N'مترجمة'),
	('304',  '1704', N'متردوتيل'),
	('305',  '1705', N'مجلد'),
	('306',  '1710', N'مجهز طائرة'),
	('307',  '1572', N'كهربائى'),
	('308',  '1584', N'كهربائى سيارات'),
	('309',  '1590', N'كهربائى معدات'),
	('310',  '1596', N'كوافير'),
	('311',  '1599', N'كوافيره'),
	('312',  '1606', N'كيميائية'),
	('313',  '1632', N'حاصل على ليسانس لغات وترجمه'),
	('314',  '1633', N'حاصل على ليسانس حقوق'),
	('315',  '1635', N'م اخصائى نساء وولادة'),
	('316',  '1499', N'قارى عدادات'),
	('317',  '1500', N'قارىء قرآن كريم'),
	('318',  '1501', N'قلاى سمك'),
	('319',  '1502', N'قمصانجى'),
	('320',  '1503', N'قهوجى'),
	('321',  '1505', N'كابتن'),
	('322',  '1550', N'كاتبة'),
	('323',  '1556', N'كاشير'),
	('324',  '1557', N'كبابجى'),
	('325',  '1567', N'كميائى'),
	('326',  '1568', N'كنترول'),
	('327',  '1423', N'فنى طلاء'),
	('328',  '1424', N'فنى طلمبات ديزل'),
	('329',  '1429', N'فنى رخام'),
	('330',  '1431', N'فنى قياسات'),
	('331',  '1432', N'فنى كمبيوتر'),
	('332',  '1433', N'فنى كهرباء'),
	('333',  '1437', N'فنى لاسلكى'),
	('334',  '1438', N'فنى لحام'),
	('335','1440', N'فنى لف دينمو'),
	('336','1442', N'فنى مبانى'),
	('337','1444', N'فنى مختبر'),
	('338','1447', N'فنى مساعد'),
	('339','1451', N'فنى مصاعد'),
	('340',  '1455', N'فنى معادن'),
	('341',  '1456', N'فنى معدات'),
	('342',  '1459', N'فنى مكتبات'),
	('343',  '1462', N'فنى منسوجات جلدية'),
	('344',  '1463', N'فنى منشات'),
	('345',  '1467', N'فنى ميكانيكى'),
	('346',  '1470', N'فنى ميكروفيلم'),
	('347',  '1473', N'فنى هندسة'),
	('348',  '1480', N'فنى بطاريات'),
	('349',  '1485', N'فنية تحليل'),
	('350',  '1486', N'فنية تشغيل'),
	('351',  '1487', N'فنية علاج طبيعى'),
	('352',  '1489', N'فنيه احصاء'),
	('353',  '1492', N'فنيه بصريات'),
	('354',  '1493', N'فنيه مختبر'),
	('355',  '1494', N'فنيه'),
	('356',  '1495', N'فنيه معمل'),
	('357',  '1496', N'فوال'),
	('358',  '1497', N'فيتر معدات'),
	('359',  '1498', N'فيزيائى'),
	('360',  '1351', N'فنى تليفونات'),
	('361',  '1352', N'فنى تمريض'),
	('362',  '1353', N'فنى تنفيذ'),
	('363',  '1357', N'فنى توصيلات'),
	('364',  '1367', N'فنى جبس'),
	('365',  '1371', N'فنى حدائق ومشاتل'),
	('366',  '1373', N'فنى حفر'),
	('367',  '1376', N'فنى دعاية'),
	('368',  '1378', N'فنى دهانات'),
	('369',  '1379', N'فنى دوكو'),
	('370',  '1380', N'فنى ديكور'),
	('371',  '1382', N'فنى راديو وتليفزيون'),
	('372',  '1383', N'فنى رسام'),
	('373',  '1384', N'فنى زجاج'),
	('374',  '1386', N'فنى زراعى'),
	('375',  '1389', N'فنى ستائر'),
	('376',  '1395', N'فنى شبكه'),
	('377',  ' 1398', N'فنى صناعة اسنان'),
	('378',  '1399', N'فنى صناعى'),
	('379',  '1400', N'فنى صوت'),
	('380',  '1405', N'فنى صيانه'),
	('381',  '1415', N'فنى ضبط زوايا'),
	('382',  '1422', N'فنى طبى'),
	('383',  '1282', N'فنى اشعه'),
	('384',  '1285', N'فنى اعلان'),
	('385',  '1286', N'فنى الات'),
	('386',  '1289', N'فنى الكترونيات'),
	('387',  '1295', N'فنى الوميتال'),
	('388',  '1296', N'فنى انتاج'),
	('389',  '1297', N'فنى انشاءات'),
	('390',  '1298', N'فنى اوفست'),
	('391',  '1302', N'فنى اول معدات'),
	('392',  '1307', N'براد'),
	('393',  '1311', N'فنى براويز'),
	('394',  '1314', N'فنى بصريات'),
	('395',  '1315', N'فنى بلاستيك'),
	('396',  '1320', N'فنى تبريد وتكييف'),
	('397',  '1326', N'فنى تجليد'),
	('398',  '1327', N'فنى تحاليل'),
	('399',  '1328', N'فنى تحميض'),
	('400',  '1329', N'فنى تخطيط'),
	('401',  '1332', N'فنى تركيبات'),
	('402',  '1333', N'فنى تركيبات الومنيوم'),
	('403',  '1337', N'فنى تشغيل'),
	('404',  '1339', N'فنى تشغيل كمبيوتر'),
	('405',  '1344', N'فنى تصوير'),
	('406',  '1222', N'عاملة'),
	('407',  '1231', N'عتال'),
	('408',  '1232', N'عجان'),
	('409',  '1235', N'عربجى'),
	('410',  '1236', N'عضو مناهج'),
	('411',  '1242', N'فنى علاج طبيعى'),
	('412','1246', N'غسال ملابس'),
	('413','1247', N'فاحص'),
	('414','1248', N'فاحص فنى'),
	('415','1249', N'فارز بريد'),
	('416','1254', N'فراش'),
	('417','1256', N'فراشه'),
	('418','1257', N'فران'),
	('419','1260', N'فرد بالقوات المسلحه'),
	('420','1261', N'فررجى'),
	('421','1263', N'فطاطرى'),
	('422','1265', N'فلاح'),
	('423','1266', N'فنان تشكيلى'),
	('424','1267', N'فندقى'),
	('425','1270', N'فنى  زخرفة'),
	('426','1271', N'فنى اتصالات'),
	('427','1272', N'فنى اجهزة'),
	('428','1278', N'فنى احصاء وتسجيل طبى'),
	('429','1279', N'فنى اسطمبات'),
	('430','1280', N'فنى اسنان'),
	('431','995', N'طبيب تخدير'),
	('432','996', N'طبيب جراحه عامه'),
	('433','998', N'طبيب رمد'),
	('434','1000', N'طبيب عظام'),
	('435','1004', N'طبيب نفسى'),
	('436','1006', N'طبيبة اسنان'),
	('437','1015', N'طبيبه بشريه'),
	('438','1017', N'طبيبه تخدير'),
	('439','1019', N'طبيبه نساء'),
	('440','1025', N'طعمجى'),
	('441','1026', N'طلاء معادن'),
	('442','1028', N'طيار مدنى'),
	('443','1036', N'ضابط لاسلكى'),
	('444','1037', N'ضابطه شرطه'),
	('445','913', N'ضابط شرطه مهندس'),
	('446','914', N'ضابط طبيب'),
	('447','917', N'ضباط حجانى'),
	('448','919', N'طابع'),
	('449','928', N'طابعه'),
	('450','929', N'طالبه'),
	('451','930', N'طاهى'),
	('452','931', N'طاهية'),
	('453','932', N'طباخ'),
	('454','938', N'طباخة'),
	('455','953', N'طبيب بشرى'),
	('456','955', N'طبيب اخصائى اسنان'),
	('457','956', N'طبيب اخصائى اطفال'),
	('458','962', N'طبيب امراض نساء وولاده'),
	('459','963', N'طبيب باطنى'),
	('460','972', N'طبيب بشرى قلب واوعيه دمويه'),
	('461','973', N'طبيب بشرىاخصائى جراحه عامه'),
	('462','982', N'طبيب بيطرى'),
	('463','840', N'شرطى'),
	('464','844', N'شيال'),
	('465','847', N'شيف'),
	('466','851', N'صائغ'),
	('467','852', N'صاحب شركة'),
	('468','859', N'صاحب محل'),
	('469','868', N'صاحب مصنع'),
	('470','873', N'صاحب ورشه'),
	('471','877', N'صانع'),
	('472','882', N'صباغ'),
	('473','883', N'صحفى'),
	('474','884', N'صحفيه'),
	('475','885', N'صراف'),
	('476','894', N'صياد'),
	('477','897', N'صيدلانية'),
	('478','899', N'صيدلى'),
	('479','902', N'ضابط'),
	('480','903', N'ضابط امن'),
	('481','904', N'ضابط اعالى البحار'),
	('482','905', N'ضابط بالمعاش'),
	('483','906', N'ضابط بحرى'),
	('484','907', N'ضابط مراقبه'),
	('485','909', N'ضابط شرطه'),
	('486','911', N'ضابط شرطه طبيب'),
	('487','784', N'ساعاتى'),
	('488','785', N'ساعى'),
	('489','787', N'سايس'),
	('490','788', N'سباك'),
	('491','792', N'سباك معادن'),
	('492','796', N'سروجى'),
	('493','797', N'سروجى سيارات'),
	('494','798', N'سروجى شنط'),
	('495','815', N'سكرتيرة'),
	('496','820', N'سلاخ'),
	('497','827', N'سمكرى'),
	('498','835', N'سياحة وفنادق'),
	('499','604', N'ريس بحرى'),
	('500','607', N'زائره صحيه'),
	('501','610', N'زوجه'),
	('502','531', N'رئيس بحوث'),
	('503','532', N'رئيس حركة'),
	('504','533', N'رئيس حسابات'),
	('505','534', N'رئيس حفار'),
	('506','535', N'رئيس خدمات'),
	('507','538', N'رئيس خزينة'),
	('508','542', N'رئيس سنترال'),
	('509','544', N'رئيس شعبة'),
	('510','548', N'رئيس طهاه'),
	('511','580', N'رئيس وحده'),
	('512','586', N'ربان'),
	('513','588', N'رجل اطفاء'),
	('514','589', N'رجل اعمال'),
	('515','591', N'رسام'),
	('516','593', N'رسام علمى'),
	('517','594', N'رسام فنى'),
	('518','595', N'رسام كهرباء'),
	('519','596', N'رسام معمارى'),
	('520','599', N'رسام هندسى'),
	('521','447', N'حفار'),
	('522','450', N'حفار موبيليات'),
	('523','452', N'حكيمه'),
	('524','455', N'حلاق'),
	('525','456', N'حلوانى'),
	('526','457', N'حمال'),
	('527','459', N'خادم'),
	('528','461', N'خادم مسجد'),
	('529','462', N'خادمه'),
	('530','464', N'خباز'),
	('531','465', N'خبير احصاء'),
	('532','466', N'خبير اختزال'),
	('533','467', N'خبير اقتصادى'),
	('534','468', N'خبير ببنك'),
	('535','469', N'خبير بصمات'),
	('536','471', N'خبير تنميه اداريه'),
	('537','472', N'خبير ميزانيه'),
	('538','473', N'خبيراقتصادى زراعى'),
	('539','474', N'خراط'),
	('540','484', N'خضرى'),
	('541','485', N'خطاط'),
	('542','488', N'خفير'),
	('543','491', N'عامل احذيه'),
	('544','497', N'خياطة'),
	('545','505', N'دكتور'),
	('546','509', N'دكتور مهندس'),
	('547','510', N'دكتوراه فى الصيدلة'),
	('548','512', N'دكتورة'),
	('549','513', N'دكتورة امراض نساء'),
	('550','515', N'دهان'),
	('551','516', N'دهان دوكو'),
	('552','518', N'دهان مبانى'),
	('553','520', N'دهان موبيليا'),
	('554','527', N'رئيس  قسم'),
	('555','369', N'بناء معمارى'),
	('556','370', N'تاجر'),
	('557','375', N'ترزى'),
	('558','380', N'ممرض'),
	('559','381', N'تومرجى'),
	('560','384', N'تومرجية'),
	('561','387', N'جراح'),
	('562','388', N'جرسون'),
	('563','393', N'جزمجى'),
	('564','396', N'جمال'),
	('565','399', N'جناينى'),
	('566','402', N'جيولوجى'),
	('567','405', N'حارس'),
	('568','414', N'حاصل على بكالوريوس تربيه'),
	('569','415', N'حاصل على بكالوريوس علوم'),
	('570','416', N'حاصل على ثانويه عامه'),
	('571','417', N'حاصل على دبلوم اسعاف'),
	('572','418', N'حاصل على دبلوم تجاره'),
	('573','419', N'حاصل على دبلوم زراعه'),
	('574','420', N'حاصل على دبلوم صنايع'),
	('575',  '421', N'حاصل على دبلوم فنى تجارى'),
	('576',  '423', N'حاصل على ليسانس اداب'),
	('577','424', N'حاصل على ليسانس شريعه'),
	('578','426', N'حداد'),
	('579','434', N'حداد مسلح'),
	('580','437', N'حرفى'),
	('581','291', N'بائع تذاكر طيران'),
	('582','313', N'بائعة'),
	('583','327', N'باحث تخطيط'),
	('584','328', N'باحث تدريب مهنى'),
	('585','330', N'باحث زراعى'),
	('586','331', N'باحث شرطه'),
	('587','332', N'باحث شكاوى'),
	('588','333', N'باحث ضريبى'),
	('589','334', N'باحث فنى'),
	('590','336', N'باحث مساعد'),
	('591','337', N'باحث موازنه'),
	('592','338', N'باحث ميزانيه'),
	('593','339', N'باحث نفسى'),
	('594',  '340', N'باحثه'),
	('595',  '343', N'باحث قانوني'),
	('596',  '344', N'بارمان'),
	('597',  '346', N'بالمعاش'),
	('598',  '347', N'بالمعاش  قوات مسلحه'),
	('599',  '349', N'بحرى ثان هيئة قناة السويس'),
	('600',  '351', N'بدون عمل'),
	('601',  '358', N'بستانى'),
	('602',  '360', N'بشكار'),
	('603',  '362', N'بكالوريوس تجاره'),
	('604',  '364', N'بكالوريوس علوم وتربيه'),
	('605',  '220', N'استشارى الجراحه العامه'),
	('606',  '221', N'استشارى طب الاسنان'),
	('607',  '222', N'استشارى عيون'),
	('608',  '223', N'استعلامات'),
	('609',  '224', N'استقبال'),
	('610',  '225', N'استورجى'),
	('611',  '226', N'اعمال اداريه'),
	('612',  '228', N'اعمال تحف بالموبليا'),
	('613',  '229', N'اعمال حره'),
	('614',  '230', N'اعمال زخرفة'),
	('615',  '231', N'اعمال مكتبية'),
	('616',  '232', N'اغذية ومشروبات'),
	('617',  '233', N'اخصائى'),
	('618',  '239', N'امام مسجد'),
	('619',  '240', N'امام وخطيب'),
	('620',  '247', N'امين خزانه'),
	('621',  '249', N'امين شرطه'),
	('622',  '251', N'امين شرطه سابقا'),
	('623',  '252', N'امين صندوق'),
	('624',  '257', N'امين مختبر'),
	('625',  '262', N'امين مستودع'),
	('626',  '264', N'امين معمل'),
	('627',  '265', N'امين مكتبة'),
	('628',  '268', N'امينة صندوق'),
	('629',  '270', N'امينه مكتبه'),
	('630',  '271', N'اويمجى'),
	('631',  '152', N'اخصائى معلومات'),
	('632',  '153', N'اخصائى مكتبات'),
	('633',  '154', N'اخصائى مهنى'),
	('634',  '158', N'اخصائى نفسى'),
	('635',  '159', N'اخصائى هندسى'),
	('636',  '160', N'اخصائية اجتماعية'),
	('637',  '162', N'اخصائية امراض نساء وتوليد'),
	('638',  '165', N'اخصائية تحاليل طبية'),
	('639',  '167', N'اخصائية نفسية'),
	('640',  '170', N'اخصائيه اشعه'),
	('641',  '172', N'اخصائيه تجميل'),
	('642',  '173', N'اخصائيه تخدير'),
	('643',  '174', N'اخصائيه تغذيه'),
	('644',  '175', N'اخصائيه تمريض'),
	('645',  '176', N'اخصائيه رياضيه'),
	('646',  '177', N'اخصائيه علاج طبيعى'),
	('647',   '180', N'ادارى'),
	('648',  '184', N'ادارية'),
	('649',  '185', N'ادخال معلومات'),
	('650',  '187', N'اذاعى'),
	('651',  '201', N'استاذ جامعى'),
	('652',  '203', N'استاذ جامعى سابقا'),
	('653',  '206', N'استاذ مساعد بالجامعه'),
	('654',  '85', N'اخصائى بصريات'),
	('655',  '89', N'اخصائى تحاليل'),
	('656',  '94', N'اخصائى تخدير'),
	('657',  '96', N'اخصائى تخطيط'),
	('658',  '98', N'اخصائى تدريب'),
	('659',  '99', N'اخصائى تدريس اول'),
	('660',  '100', N'اخصائى تدليك'),
	('661',  '101', N'اخصائى تركيبات اسنان صناعية'),
	('662',  '102', N'اخصائى تسجيل اثرى'),
	('663',  '107', N'اخصائى تصميم برامج ثالث'),
	('664',  '108', N'اخصائى تغذيه'),
	('665',  '109', N'اخصائى تنفيذ'),
	('666',  '116', N'اخصائى جراحه'),
	('667',  '118', N'اخصائى جراحه عظام'),
	('668',  '119', N'اخصائى حاسب الى'),
	('669',  '123', N'اخصائى رسم'),
	('670',  '125', N'اخصائى رياضى'),
	('671',  '128', N'اخصائى زخرفة واعلان'),
	('672',  '129', N'اخصائى زراعى'),
	('673',  '130', N'اخصائى ش تجارية'),
	('674',  '133', N'اخصائى شئون ادارية'),
	('675',  '136', N'اخصائى شئون ماليه'),
	('676',  '137', N'اخصائى صناعات غذائية'),
	('677','140', N'اخصائى علاقات عامه'),
	('678','141', N'اخصائى علوم'),
	('679','142', N'اخصائى فنون'),
	('680','143', N'اخصائى فنى'),
	('681','146', N'كيميائى'),
	('682','147', N'اخصائى مبيعات'),
	('683','148', N'اخصائى مختبرات'),
	('684','2', N'محاسب'),
	('685','3', N'باحث'),
	('686','5', N'منجد'),
	('687','7', N'امين مخزن'),
	('688','8', N'بائع'),
	('689','10', N'جزار'),
	('690','11', N'خياط'),
	('691','12', N'رئيس صف'),
	('692','13', N'سائق'),
	('693','1', N'عامل'),
	('694','16', N'سفرجى'),
	('695','17', N'سكرتير'),
	('696','18', N'ضابط ادارى'),
	('697','22', N'فنى'),
	('698','23', N'فنى مونتاج'),
	('699','24', N'كاتب'),
	('700','28', N'مدرس'),
	('701','33', N'مندوب مبيعات'),
	('702','34', N'مهندس كهرباء'),
	('703','35', N'مهندس مدنى'),
	('704','37', N'موظف بشركه خاصه'),
	('705','39', N'نجار مسلح'),
	('706','41', N'موظف'),
	('707','43', N'موظف بجهه اجنبيه داخل'),
	('708','45', N'مدير عام'),
	('709','47', N'طالب'),
	('710','48', N'نجار'),
	('711','49', N'مشغل كمبيوتر'),
	('712','50', N'اخصائى علاج طبيعى'),
	('713','51', N'اخصائى اتصالات'),
	('714','52', N'اخصائى ابحاث'),
	('715','53', N'اخصائى اجتماعى'),
	('716','56', N'اخصائى اجهزه زجاجيه'),
	('717','57', N'اخصائى احصاء'),
	('718','59', N'اخصائى استثمارات'),
	('719','60', N'اخصائى استيراد'),
	('720','62', N'اخصائى اشعه'),
	('721','63', N'اخصائى اصابات ملاعب'),
	('722','64', N'اخصائى اضاءة'),
	('723','66', N'اخصائى اعلام'),
	('724','68', N'اخصائى اعلان'),
	('725','69', N'اخصائى افراد'),
	('726','70', N'اخصائى الكترونات'),
	('727','71', N'اخصائى امراض  باطنه'),
	('728','72', N'اخصائى امراض نساء وتوليد'),
	('729','74', N'اخصائى انتاج'),
	('730','75', N'اخصائى انشاءات'),
	('731','76', N'اخصائى مالى'),
	('732','77', N'اخصائى مشتريات'),
	('733','78', N'اخصائى سمع وكلام'),
	('734','79', N'اخصائى رمد'),
	('735','80', N'اخصائى باطنه عامه'),
	('736','2809', N'نقاش'),
	('737','2820', N'نقش وزخرفه'),
	('738','2824', N'واعظ'),
	('739','2825', N'وتار'),
	('740','2827', N'وزاره الصحه'),
	('741','2828', N'وكيل'),
	('742','2829', N'وكيل ثانوى'),
	('743','2830', N'وكيل قسم بمؤسسه الاهرام'),
	('744','2831', N'وكيل مدرسه'),
	('745','2833', N'وكيل وزاره'),
	('746','2836', N'حاصل على بكالوريوس  ت .زراعى'),
	('747','2837', N'حاصل على معهد فنى صناعى'),
	('748','2838', N'استشارى'),
	('749','2839', N'طيار'),
	('750','2840', N'غير متاح'),
	('751','2841', N'صاحب مكتب استيراد وتصدير'),
	('752','2842', N'شريك'),
	('753','2843', N'مدير شركة'),
	('754','2844', N'عامله منزليه'),
	('755','2845', N'مدرسه خاصه'),
	('756','2846', N'جليسة اطفال'),
	('757','2847', N'ممرضة منزليه'),
	('758','2848', N'فنان');
                SET IDENTITY_INSERT JobTypes OFF
                ");
            }
            context.SaveChanges();
        }

        [Obsolete]
        private static void SeedQualification(ApplicationContext context)
        {
            if (context.Qualification.Count() == 0)
            {
                context.Database.ExecuteSqlRaw(@"

                SET IDENTITY_INSERT Qualification ON

                INSERT INTO Qualification (Id, Name) VALUES
                (N'1', N'لم يتم تسجيله'),
                (N'2', N'كلية الصيدلة'),
                (N'3', N'كلية الهندسة'),
                (N'4', N'كلية التخطيط العمرانى'),
                (N'5', N'كلية العلوم'),
                (N'6', N'كلية البحرية'),
                (N'7', N'كلية فنون جميلة قسم فنون'),
                (N'8', N'كليةالهندسةالالكترونية'),
                (N'9', N'كلية تربية (اقتصاد منزلى)'),
                (N'10', N'كلية الاقتصادوالعلوم السياسية'),
                (N'11', N'كلية الاثار'),
                (N'12', N'كلية الاداب'),
                (N'13', N'كلية الحقوق'),
                (N'14', N'كليةالبنات للاداب والعلوم والتربيه'),
                (N'15', N'كلية التربية الرياضية'),
                (N'16', N'كلية السياحة والفنادق'),
                (N'17', N'كليةالطب'),
                (N'25', N'المعهد العالى للتعاون الزراعى'),
                (N'26', N'كليه الخدمه الاجتماعية'),
                (N'27', N'كلية رياض الاطفال'),
                (N'29', N'المعهدالعالى للسياحه والفنادق'),
                (N'30', N'معهدالالسن العالى'),
                (N'31', N'كليةالدراسات النوعيه'),
                (N'34', N'كليه التربية'),
                (N'35', N'كليه الفنون التطبيقيه'),
                (N'37', N'كلية طب الفم والأسنان'),
                (N'38', N'كلية العلاج الطبيعى'),
                (N'39', N'كلية الطب البيطرى'),
                (N'40', N'كلية الزراعة'),
                (N'41', N'المعهد العالى للتمريض'),
                (N'42', N'كلية فنون جميلة قسم عمارة'),
                (N'43', N'كليةالهندسةوالتكنولجيا'),
                (N'44', N'كلية البترول والتعدين'),
                (N'45', N'المعهد العالى للتكنولجيا'),
                (N'46', N'كلية التجارة'),
                (N'47', N'كلية الاعلام'),
                (N'48', N'كلية دار علوم'),
                (N'49', N'كليةالدراسات العربيةوالاسلامية'),
                (N'50', N'كلية الالسن'),
                (N'51', N'كلية التربية الفنية'),
                (N'52', N'كلية التربية الموسيقية'),
                (N'53', N'كلية التربية النوعية'),
                (N'62', N'المعهدالعالى للدراسات التعاونيه'),
                (N'63', N'المعهدالعالى للخدمه الاجتماعية'),
                (N'18', N'المعهدالفنى الصحى'),
                (N'19', N'المعهدالفنى للتلفزيون'),
                (N'20', N'المعهدالفنى لتكنولوجياالاسنان'),
                (N'21', N'المعهدالفنى لتكنولوجيا الالم'),
                (N'28', N'المعهد التوسط للخدمه الاجتماعيه'),
                (N'32', N'معهدالاداره والسكرتارية'),
                (N'33', N'معهدالدراسات النوعيه'),
                (N'54', N'المعهدالفنى الصناعى'),
                (N'55', N'المعهدالفنى للبصريات'),
                (N'56', N'م الفنى للرى والصرف والمساحه'),
                (N'57', N'المعهدالفنى الصناعى للمنشات'),
                (N'58', N'المعهدالفنى لمواد البناء'),
                (N'61', N'المعهد الفنى للفنادق'),
                (N'22', N'دبلوم تجارة'),
                (N'23', N'دبلوم صنايع'),
                (N'24', N'ثانويه عامه'),
                (N'36', N'دبلوم فندقه'),
                (N'59', N'دبلوم زراعة'),
                (N'60', N'دبلوم معلمين'),
                (N'64', N'بدون مـؤهـل'),
                (N'65', N'دبلوم تمريض'),
                (N'66', N'دبلوم بريد'),
                (N'67', N'الجامعه الأمريكيه'),
                (N'68', N'غير متاح'),
                (N'69', N'الكليه الحربيه'),
                (N'70', N'معهد اللاسلكى'),
                (N'71', N'معهد الاداره والحاسب الالى'),
                (N'72', N'كلية الشرطة'),
                (N'73', N'كلية الدفاع الجوى'),
                (N'74', N'المعهد الفنى الكيماوى'),
                (N'75', N'غير متاح'),
                (N'76', N'معهد السياحه والفنادق'),
                (N'77', N'غير متاح'),
                (N'78', N'معهد امناء الشرطه'),
                (N'79', N'المعهد العالى للموسيقى العربيه'),
                (N'80', N'غير متاح'),
                (N'81', N'كليةالشريعةوالقانون'),
                (N'82', N'كليةاصول الدين'),
                (N'83', N'المعهد الفنى المعمارى'),
                (N'84', N'اكاديمية السادات للعلوم الإداريه'),
                (N'85', N'معهد التربيه الرياضيه'),
                (N'86', N'المعهد العالى للفنون المسرحيه'),
                (N'87', N'المعهد العالى للسينما'),
                (N'88', N'اكاديميه النقل البحرى'),
                (N'89', N'ثانوى ازهرى'),
                (N'90', N'كليه الجويه'),
                (N'91', N'كليه علوم حاسب آلى'),
                (N'92', N'كليه الدراسات الانسانيه'),
                (N'93', N'كليه لغات وترجمه'),
                (N'94', N'دبلوم بحرى'),
                (N'95', N'دبلوم محصلين وصيارفه'),
                (N'96', N'معهد الكفايه الانتاجيه'),
                (N'97', N'معهد فنى القوات المسلحه'),
                (N'98', N'كليه التعليم الصناعى'),
                (N'99', N'كلية الاقتصاد المنزلى'),
                (N'100', N'الجامعة العمالية'),
                (N'101', N'دبلوم خطوط'),
                (N'102', N'كلية نظم ومعلومات'),
                (N'103', N'كلية اللغه العربيه بالازهر'),
                (N'104', N'دبلوم مساحه'),
                (N'105', N'المعهدالفنى التجارى')



                SET IDENTITY_INSERT Qualification OFF
                ");
            }
            context.SaveChanges();
        }
        [Obsolete]
        private static void SeedReferenceItems(ApplicationContext context)
        {
            if (context.ReferenceItems.Count() == 0)
            {
                context.Database.ExecuteSqlRaw(@"

                SET IDENTITY_INSERT ReferenceItems ON

                INSERT INTO ReferenceItems (Id, WPCode , Name , BankCode , Duplicated) VALUES
                  (1, 1, N'ملف', 0, 1),
                  (2, 2, N'وثيقة التصريح', 0, 1),
                  (3, 3, N'عمولة المحصل', 0, 1),
                  (4, 4, N'طابع الشهيد', 0, 1),
                  (5, 5, N'طابع الشرطة', 0, 1),
                  (6, 6, N'طابع دعم ذو الإعاقة', 0, 1),
                  (7, 7, N'مستعجل / qr', 57, 0),
                  (8, 8, N'استمارة ميكنة الخدمة', 59, 0),
                  (9, 9, N'إستعلام انترنت', 58, 0),
                  (10, 10, N'استعلام عن تصريح سابق/ بدل فاقد', 99, 0),
                  (11, 11, N'سنوات بحث', 55, 0),
                  (12, 12, N' أستمارة (مؤهل متوسط - بدون مؤهل),', 0, 1),
                  (13, 13, N'استمارة مؤهل عالى', 0, 1),
                  (14, 14, N'تسوية / فرق مؤهل', 98, 1)
                SET IDENTITY_INSERT ReferenceItems OFF
                ");
            }
            context.SaveChanges();
        }

        [Obsolete]
        private static void SeedReligions(ApplicationContext context)
        {
            try
            {
                if (context.Religions.Count() == 0)
                {
                    context.Database.ExecuteSqlRaw(@"

                SET IDENTITY_INSERT Religions ON

                INSERT INTO Religions (Id, Name ) VALUES
                  (1, N'مسلم'),
                  (2, N'مسيحي')
                 
                SET IDENTITY_INSERT Religions OFF
                ");
                }
                context.SaveChanges();
            }
            catch (Exception e)
            {
                var ms = e.Message;
            }

        }
        [Obsolete]
        private static void SeedFinancialClearanceType(ApplicationContext context)
        {
            try
            {
                if (context.FinancialClearanceType.Count() == 0)
                {
                    context.Database.ExecuteSqlRaw(@"

                SET IDENTITY_INSERT FinancialClearanceType ON

                INSERT INTO FinancialClearanceType (Id, Name ) VALUES
                  (1, N'مخالصه عوده من العمل'),
                  (2, N'مخالصه تجديد اجازه')
                 
                SET IDENTITY_INSERT FinancialClearanceType OFF
                ");
                }
                context.SaveChanges();
            }
            catch (Exception e)
            {
                var ms = e.Message;
            }

        }

        [Obsolete]
        private static void SeedBankCodes(ApplicationContext context)
        {
            try
            {
                if (context.BankCodes.Count() == 0)
                {
                    context.Database.ExecuteSqlRaw(@"

                SET IDENTITY_INSERT BankCodes ON

                INSERT INTO BankCodes (Id, Code, Price, Name, ReferenceItemIds ) VALUES
                 (1, 51, 445, N'منتج حج مؤهل عالى-أنترنت- طابع شهيدط.شرطة', NULL),
                 (2, 52, 300, N'منتج حج مؤهل عالى-بدون أنترنت- طابع شهيدط.شرطة', NULL),
                 (3, 53, 345, N'منتج حج مؤهل متوسط-انترنت-ط. شهيد-ط. شرطة', NULL),
                 (4, 54, 200, N'منتج حج مؤهل متوسط-بدون أنترنت-ط.شهيد-ط.شرطة', NULL),
                 (5, 55, 0.5, N'منتج حج --تسويات / سنوات بحث', NULL),
                 (6, 57, 100, N'خدمة المستعجل / QR', NULL),
                 (7, 58, 10, N'انترنت', NULL),
                 (8, 59, 35, N'استمارة ميكنة', NULL),
                 (9, 99, 26, N'استعلام عن تصريح سابق/ بدل فاقد', NULL),
                 (10, 5, 185, N'استمارة مؤهـل عالى-أنترنت س.سابقة', NULL),
                 (11, 6, 175, N'استمارة مؤهل عالى س.سابقة', N'1,2,3,14,'),
                 (12, 7, 145, N'أستمارة (مؤهل متوسط - بدون مؤهل),, أنترنت س.سابقة', NULL),
                 (13, 8, 135, N'أستمارة (مؤهل متوسط - بدون مؤهل),, س.سابقة', N'1,2,3,12,'),
                 (14, 9, 295, N'استمارة مؤهـل عالى-طابع الشهيد', NULL),
                 (15, 10, 180, N'أستمارة (مؤهل متوسط - بدون مؤهل),, ط.الشهيد', NULL),
                 (16, 11, 300, N'استمارة مؤهـل عالى-أنترنت-طابع الشهيد-ط.شرطة', N'1,2,3,4,5,6,15,'),
                 (17, 2, 275, N'استمارة مؤهل عالى', N'1,2,3,15,'),
                 (18, 4, 175, N'أستمارة (مؤهل متوسط - بدون مؤهل),,', N'1,2,3,13,'),
                 (19, 9, 295, N'استمارة مؤهـل عالى-طابع الشهيد', N'1,2,3,4,15,'),
                 (20, 16, 195, N'أستمارة (مؤهل متوسط - بدون مؤهل),, ط.الشهيد', N'1,2,3,4,5,13,'),
                 (21, 3, 200, N'أستمارة (مؤهل متوسط - بدون مؤهل),, ط.الشهيد-ط.شرطة', N'1,2,3,4,5,6,13,'),
                 (22, 59, 35, N'استمارة ميكنة', N'8,'),
                 (23, 99, 26, N'استعلام عن تصريح سابق/ بدل فاقد', N'10,'),
                 (24, 55, 0.5, N'منتج حج --تسويات / سنوات بحث', N'11,'),
                 (25, 57, 100, N'خدمة المستعجل / QR', N'7,'),
                 (26, 58, 10, N'انترنت', N'9,'),
                 (27, 98, 0, N'تسوية / فرق مؤهل', N'1,2,3,4,5,15,'),
                 (28, 100, 0, N'----', N'16,')و
                 (29, 101, 0, N'رسوم خزانة', N'1,2,3,4,5,6,')
                 
                SET IDENTITY_INSERT BankCodes OFF
                ");
                }
                context.SaveChanges();
            }
            catch (Exception e)
            {
                var ms = e.Message;
            }

        }
        [Obsolete]
        private static void SeedGenders(ApplicationContext context)
        {
            try
            {
                if (context.Genders.Count() == 0)
                {
                    context.Database.ExecuteSqlRaw(@"

                SET IDENTITY_INSERT Genders ON

                INSERT INTO Genders (Id,Code ,Name ) VALUES
                 (1, N'M', N'ذكر'),
                 (2, N'F', N'أنثي')
                 
                SET IDENTITY_INSERT Genders OFF
                ");
                }
                context.SaveChanges();
            }
            catch (Exception e)
            {
                var ms = e.Message;
            }

        }

        [Obsolete]
        private static void SeedItemsPricing(ApplicationContext context)
        {
            try
            {
                if (context.ItemsPricing.Count() == 0)
                {
                    context.Database.ExecuteSqlRaw(@"

                SET IDENTITY_INSERT ItemsPricing ON

                INSERT INTO ItemsPricing (Id, WPCode , Price , Start ) VALUES
                      (1, 1, 15, CAST(N'1999-01-01' AS Date))
                    , (2, 2, 17, CAST(N'1999-01-01' AS Date))
                    , (3, 3, 43, CAST(N'1999-01-01' AS Date))
                    , (4, 4, 5, CAST(N'2019-01-08' AS Date))
                    , (5, 5, 15, CAST(N'2019-07-07' AS Date))
                    , (6, 6, 5, CAST(N'2021-05-23' AS Date))
                    , (7, 7, 100, CAST(N'1999-01-01' AS Date))
                    , (8, 8, 35, CAST(N'1999-01-01' AS Date))
                    , (9, 9, 10, CAST(N'1999-01-01' AS Date))
                    , (10, 10, 26, CAST(N'1999-01-01' AS Date))
                    , (11, 11, 0.5, CAST(N'1999-01-01' AS Date))
                    , (12, 12, 60, CAST(N'1999-01-01' AS Date))
                    , (13, 12, 100, CAST(N'2016-10-01' AS Date))
                    , (14, 13, 100, CAST(N'1999-01-01' AS Date))
                    , (15, 13, 200, CAST(N'2016-10-01' AS Date))
                    , (16, 14, 0, CAST(N'1999-01-01' AS Date))
                SET IDENTITY_INSERT ItemsPricing OFF
                ");
                }
                context.SaveChanges();

                context.Database.ExecuteSqlRaw(
                     @"  update ItemsPricing 
                      set[End] = CAST(N'2016-09-30' AS Date) where id = 12

                        update ItemsPricing
                      set[End] = CAST(N'2016-09-30' AS Date) where id = 14"
                    );
                context.SaveChanges();
            }
            catch (Exception e)
            {
                var msg = e;
            }

        }
        [Obsolete]
        private static void SeedIStates(ApplicationContext context)
        {
            try
            {
                if (context.States.Count() == 0)
                {
                    context.Database.ExecuteSqlRaw(@"
                SET IDENTITY_INSERT States ON
                INSERT INTO States (Id, Code , Name , NameAr ) VALUES
                        (1, 1, N'NEW', N'تم انشاء الطلب '),
                        (2, 2, N'WAITING_PAYMENT', N'تم اصدار إذن الدفع'),
                        (3, 3, N'PAYMENT_ACCEPTED', N'تم الدفع'),
                        (4, 4, N'WAITING_APPROVAL', N'تم استلام الطلب وجاري دراسته، عاود المتابعة خلال'),
                        (5, 5, N'APPROVED', N'تم صدور التصريح'),
                        (6, 6, N'REJECTED', N'تم إيقاف التصريح'),
                        (7, 7, N'PRODUCED', N'تم إنتاج الطلب وجاري تسليمه للناقل'),
                        (8, 8, N'ARCHIVED', N'تم أرشفة الطلب'),
                        (9, 9, N'PRINT_INVOICE', N'تم طباعه الفاتوره'),
                        (10, 10, N'PRINT_DOCUMENT', N'طباعه الوثيقة'),
                        (11, 11, N'PRINT_PERMIT', N'طباعه الاستمارة'),
                        (12, 12, N'DEFAULTE', N'حالة الطلب افتراضية'),
                        (14, 13, N'PAID_WAIT_', N'تم سداد إذن الدفع ولم يتم طباعة الكشف الأمني'),
                        (15, 14, N'QUERY_LIST_IS_PRINTED_NOT_PAID', N'تم طباعة كشف الاستعلام ولم يتم السداد')
                SET IDENTITY_INSERT States OFF
                ");
                }
                context.SaveChanges();

            }
            catch (Exception e)
            {
                var msg = e;
            }

        }

        [Obsolete]
        private static void SeedQualificationVsWPCode(ApplicationContext context)
        {
            try
            {
                if (context.QualificationVsWPCode.Count() == 0)
                {
                    context.Database.ExecuteSqlRaw(@"

               

                INSERT INTO QualificationVsWPCode (WPCodeId, QualificationId ) VALUES
                   (1, 2),
                   (2, 2),
                   (3, 2),
                   (4, 2),
                   (5, 2),
                   (6, 2),
                   (13, 2),
                   (1, 3),
                   (2, 3),
                   (3, 3),
                   (4, 3),
                   (5, 3),
                   (6, 3),
                   (12, 3)
               
                ");
                }
                context.SaveChanges();
            }
            catch (Exception e)
            {
                var msg = e;
            }

        }
        [Obsolete]
        private static void SeedItemsPricing2(ApplicationContext context)
        {
            try
            {
                if (context.ItemsPricing.Count() == 0)
                {
                    context.Database.ExecuteSqlRaw(@"

                SET IDENTITY_INSERT ItemsPricing ON
                    INSERT INTO ItemsPricing
                    (Id, WPCode, Price, Start, End) VALUES
                     (1 1 15 CAST(N'1999-01-01' AS Date) NULL),
                     (2 2 17 CAST(N'1999-01-01' AS Date) NULL),
                     (3 3 43 CAST(N'1999-01-01' AS Date) NULL),
                     (4 4 5 CAST(N'2019-01-08' AS Date) NULL),
                     (5 5 15 CAST(N'2019-07-07' AS Date) NULL),
                     (6 6 5 CAST(N'2021-05-23' AS Date) NULL),
                     (7 7 100 CAST(N'1999-01-01' AS Date) NULL),
                     (8 8 35 CAST(N'1999-01-01' AS Date) NULL),
                     (9 9 10 CAST(N'1999-01-01' AS Date) NULL),
                     (10 10 26 CAST(N'1999-01-01' AS Date) NULL),
                     (11 11 0.5 CAST(N'1999-01-01' AS Date) NULL),
                     (12 12 60 CAST(N'1999-01-01' AS Date) CAST(N'2016-09-30' AS Date)),
                     (13 12 100 CAST(N'2016-10-01' AS Date) NULL),
                     (14 13 100 CAST(N'1999-01-01' AS Date) CAST(N'2016-09-30' AS Date)),
                     (15 13 200 CAST(N'2016-10-01' AS Date) NULL),
                     (16 14 0 CAST(N'1999-01-01' AS Date) NULL)
                SET IDENTITY_INSERT ItemsPricing OFF
                ");
                }
                context.SaveChanges();
            }
            catch (Exception e)
            { var msg = e; }

        }
        [Obsolete]
        private static void SeedStats(ApplicationContext context)
        {
            if (context.States.Count() == 0)

            {
                context.Database.ExecuteSqlRaw(@"

                SET IDENTITY_INSERT States ON 
                    INSERT INTO States 
                    (Id, StateCode, Name, NameAr) VALUES
                       (1, 1, N'NEW', N'تم انشاء الطلب '),
                         (2, 2, N'WAITING_PAYMENT', N'تم اصدار إذن الدفع'),
                         (3, 3, N'PAYMENT_ACCEPTED', N'تم الدفع'),
                         (4, 4, N'WAITING_APPROVAL', N'تم استلام الطلب وجاري دراسته، عاود المتابعة خلال'),
                         (5, 5, N'APPROVED', N'تم صدور التصريح'),
                         (6, 6, N'REJECTED', N'تم إيقاف التصريح'),
                         (7, 7, N'PRODUCED', N'تم إنتاج الطلب وجاري تسليمه للناقل'),
                         (8, 8, N'ARCHIVED', N'تم أرشفة الطلب'),
                         (9, 9, N'PRINT_INVOICE', N'تم طباعه الفاتوره'),
                         (10, 10, N'PRINT_DOCUMENT', N'طباعه الوثيقة'),
                         (11, 11, N'PRINT_PERMIT', N'طباعه الاستمارة'),
                         (12, 12, N'DEFAULTE', N'حالة الطلب افتراضية'),
                         (13, 13, N'PAID_WAIT_', N'تم سداد إذن الدفع ولم يتم طباعة الكشف الأمني'),
                         (14, 14, N'QUERY_LIST_IS_PRINTED_NOT_PAID', N'تم طباعة كشف الاستعلام ولم يتم السداد'),
                         (15, 15, N'CANCELED_REQUEST', N'تم حذف الطلب')
                SET IDENTITY_INSERT States OFF
                ");
            }
            context.SaveChanges();
        }
        [Obsolete]
        private static void SeedQualificationTypes(ApplicationContext context)
        {
            if (context.Qualification.Count() == 0)
            {
                context.Database.ExecuteSqlRaw(@"

                SET IDENTITY_INSERT Qualification ON

                INSERT INTO Qualification (Id, Name) VALUES
                (N'1', N'لم يتم تسجيله'),
                (N'2', N'عالى'),
                (N'3', N'فوق المتوسط'),
                (N'4', N'متوسط'),
                (N'5', N'بدون'),
                (N'6', N'غير متاح')
                SET IDENTITY_INSERT Qualification OFF
                ");
            }
            context.SaveChanges();
        }




        [Obsolete]
        private static void SeedPoliceDepartments(ApplicationContext context)
        {
            if (context.PoliceDepartment.Count() == 0)
            {
                _ = context.Database.ExecuteSqlRaw(@"

                SET IDENTITY_INSERT PoliceDepartment ON

                INSERT INTO PoliceDepartment (Id, Name,GovernmentId) VALUES
                (N'1', N'لم يسجل',N'1'),
                (N'2', N'قسم ثالث القاهرة الجديدة',N'2'),
                (N'3', N'قسم أبو رديس',N'17'),
                (N'4', N'قسم الطور',N'17'),
                (N'5', N'قسم نخل',N'16'),
                (N'6', N'قسم شرطة رمانة',N'16'),
                (N'7', N'قسم رفح',N'16'),
                (N'8', N'قسم رابع العريش',N'16'),
                (N'9', N'قسم ثان العريش',N'16'),
                (N'10', N'قسم ثالث العريش',N'16'),
                (N'11', N'قسم بئر العبد',N'16'),
                (N'12', N'قسم الشيخ زويد',N'16'),
                (N'13', N'قسم الحسنة',N'16'),
                (N'14', N'قسم أول العريش',N'16'),
                (N'15', N'منشأة ابو عمر',N'15'),
                (N'16', N'مركز ههيا',N'15'),
                (N'17', N'مركز منيا القمح',N'15'),
                (N'18', N'مركز مشتول السوق',N'15'),
                (N'19', N'مركز كفر صقر',N'15'),
                (N'20', N'مركز فاقوس',N'15'),
                (N'21', N'مركز صان الحجر',N'15'),
                (N'22', N'قسم دهب',N'17'),
                (N'23', N'مركز ديرب نجم',N'15'),
                (N'24', N'قسم رأس سدر',N'17'),
                (N'25', N'قسم شرم الشيخ',N'17'),
                (N'26', N'مركز بنى مزار',N'19'),
                (N'27', N'مركز المنيا',N'19'),
                (N'28', N'مركز العدوة',N'19'),
                (N'29', N'مركز أبو قرقاص',N'19'),
                (N'30', N'مدينة المنيا الجديدة',N'19'),
                (N'31', N'قسم ملوى',N'19'),
                (N'32', N'قسم ثان المنيا',N'19'),
                (N'33', N'قسم ثالث المنيا',N'19'),
                (N'34', N'قسم المنيا',N'19'),
                (N'35', N'قسم أول المنيا',N'19'),
                (N'36', N'قسم مرسى مطروح',N'18'),
                (N'37', N'قسم مارينا العلمين السياحية',N'18'),
                (N'38', N'قسم سيوه',N'18'),
                (N'39', N'قسم سيدى برانى',N'18'),
                (N'40', N'قسم العلمين',N'18'),
                (N'41', N'قسم الضبعة',N'18'),
                (N'42', N'قسم السلوم',N'18'),
                (N'43', N'قسم الحمام',N'18'),
                (N'44', N'قسم نوبيع',N'17'),
                (N'45', N'قسم سانت كاترين',N'17'),
                (N'46', N'مركز بلبيس',N'15'),
                (N'47', N'مركز الزقازيق',N'15'),
                (N'48', N'مركز الحسينية',N'15'),
                (N'49', N'قسم الجنوب',N'13'),
                (N'50', N'مركز فايد',N'12'),
                (N'51', N'مركز القنطره',N'12'),
                (N'52', N'مركز القصاصين الجديدة',N'12'),
                (N'53', N'مركز التل الكبير',N'12'),
                (N'54', N'مركز الاسماعيلية',N'12'),
                (N'55', N'مركز ابو صوير',N'12'),
                (N'56', N'قسم ثان الاسماعيلية',N'12'),
                (N'57', N'قسم ثالث الاسماعيلية',N'12'),
                (N'58', N'قسم القنطرة شرق',N'12'),
                (N'59', N'قسم أول الاسماعيلية',N'12'),
                (N'60', N'مركز نبروه',N'11'),
                (N'61', N'مركز ميت غمر',N'11'),
                (N'62', N'مركز ميت سلسيل',N'11'),
                (N'63', N'مركز منية النصر',N'11'),
                (N'64', N'مركز محلة دمنة',N'11'),
                (N'65', N'مركز طلخا',N'11'),
                (N'66', N'مركز شربين',N'11'),
                (N'67', N'مركز دكرنس',N'11'),
                (N'68', N'قسم الزهور',N'13'),
                (N'69', N'قسم الشرق',N'13'),
                (N'70', N'قسم الضواحى',N'13'),
                (N'71', N'قسم العرب',N'13'),
                (N'72', N'مركز الابراهيمية',N'15'),
                (N'73', N'مركز أولاد صقر',N'15'),
                (N'74', N'مركز أبو كبير',N'15'),
                (N'75', N'مركز أبو حماد',N'15'),
                (N'76', N'قسم فاقوس',N'15'),
                (N'77', N'قسم ثان مدينة العاشر من رمضان',N'15'),
                (N'78', N'قسم ثان الزقازيق',N'15'),
                (N'79', N'قسم القنايات',N'15'),
                (N'80', N'قسم القرين',N'15'),
                (N'81', N'مركز دير مواس',N'19'),
                (N'82', N'قسم الصالحية الجديدة',N'15'),
                (N'83', N'قسم أول الزقازيق',N'15'),
                (N'84', N'قسم فيصل',N'14'),
                (N'85', N'قسم عتاقة',N'14'),
                (N'86', N'قسم السويس',N'14'),
                (N'87', N'قسم الجناين',N'14'),
                (N'88', N'قسم الاربعين',N'14'),
                (N'89', N'قسم ثان بورفؤاد',N'13'),
                (N'90', N'قسم بورفؤاد',N'13'),
                (N'91', N'قسم المناخ',N'13'),
                (N'92', N'قسم أول مدينة العاشر من رمضان',N'15'),
                (N'93', N'مركز تمى الأمديد',N'11'),
                (N'94', N'مركز سمالوط',N'19'),
                (N'95', N'مركز مطاى',N'19'),
                (N'96', N'مركز طما',N'25'),
                (N'97', N'مركز سوهاج',N'25'),
                (N'98', N'مركز ساقلته',N'25'),
                (N'99', N'مركز دار السلام-أولاد طوق شرق',N'25'),
                (N'100', N'مركز جهينة الغربية',N'25'),
                (N'101', N'مركز جرجا',N'25'),
                (N'102', N'مركز المنشاة',N'25'),
                (N'103', N'مركز المراغة',N'25'),
                (N'104', N'مركز العسيرات',N'25'),
                (N'105', N'مركز البلينا',N'25'),
                (N'106', N'مركز أخميم',N'25'),
                (N'107', N'مدينة أخميم الجديدة',N'25'),
                (N'108', N'قسم مدينة جرجا',N'25'),
                (N'109', N'قسم طهطا',N'25'),
                (N'110', N'قسم ثان سوهاج',N'25'),
                (N'111', N'قسم الكوثر',N'25'),
                (N'112', N'قسم أول سوهاج',N'25'),
                (N'113', N'مركز نصر',N'24'),
                (N'114', N'مركز كوم أمبو',N'24'),
                (N'115', N'مركز طهطا',N'25'),
                (N'116', N'مركز دراو',N'24'),
                (N'117', N'قسم قنا',N'26'),
                (N'118', N'مركز الوقف',N'26'),
                (N'119', N'مركز الأقصر',N'28'),
                (N'120', N'مركز إسنا',N'28'),
                (N'121', N'مركز أرمنت',N'28'),
                (N'122', N'قسم الأقصر',N'28'),
                (N'123', N'قسم مرسى علم',N'27'),
                (N'124', N'قسم سفاجا',N'27'),
                (N'125', N'قسم رأس غارب',N'27'),
                (N'126', N'قسم حلايب',N'27'),
                (N'127', N'قسم ثان الغردقة',N'27'),
                (N'128', N'قسم القصير',N'27'),
                (N'129', N'قسم الشلاتين',N'27'),
                (N'130', N'قسم أول الغردقة',N'27'),
                (N'131', N'مركز نقادة',N'26'),
                (N'132', N'مركز نجع حمادى',N'26'),
                (N'133', N'مركز قوص',N'26'),
                (N'134', N'مركز قنا',N'26'),
                (N'135', N'مركز قفط',N'26'),
                (N'136', N'مركز فرشوط',N'26'),
                (N'137', N'مركز دشنا',N'26'),
                (N'138', N'مركز أبو تشت',N'26'),
                (N'139', N'مركز أسوان',N'24'),
                (N'140', N'مركز أدفو',N'24'),
                (N'141', N'مركز أبو سنبل',N'24'),
                (N'142', N'مركز يوسف الصديق',N'21'),
                (N'143', N'مركز طامية',N'21'),
                (N'144', N'مركز سنورس',N'21'),
                (N'145', N'مركز الفيوم',N'21'),
                (N'146', N'مركز ابشواى',N'21'),
                (N'147', N'مركز أطسا',N'21'),
                (N'148', N'مدينة الفيوم الجديدة',N'21'),
                (N'149', N'قسم الفيوم',N'21'),
                (N'150', N'مركز ناصر-بوش سابقا',N'20'),
                (N'151', N'مركز سمسطا',N'20'),
                (N'152', N'مركز بنى سويف',N'20'),
                (N'153', N'مركز ببا',N'20'),
                (N'154', N'مركز الواسطى',N'20'),
                (N'155', N'مركز الفشن',N'20'),
                (N'156', N'مركز أهناسيا',N'20'),
                (N'157', N'قسم مدينة بنى سويف الجديدة',N'20'),
                (N'158', N'قسم بنى سويف',N'20'),
                (N'159', N'مركز ملوى',N'19'),
                (N'160', N'مركز مغاغة',N'19'),
                (N'161', N'قسم أول أسيوط',N'22'),
                (N'162', N'قسم ابو تيج',N'22'),
                (N'163', N'قسم ثان أسيوط',N'22'),
                (N'164', N'مدينة أسيوط الجديدة',N'22'),
                (N'165', N'مدينة أسوان الجديدة',N'24'),
                (N'166', N'قسم ثان اسوان',N'24'),
                (N'167', N'قسم اول اسوان',N'24'),
                (N'168', N'قسم أسوان',N'24'),
                (N'169', N'مركز شرطة باريس',N'23'),
                (N'170', N'مركز شرطة الفرافرة',N'23'),
                (N'171', N'مركز شرطة الداخلة',N'23'),
                (N'172', N'مركز بلاط',N'23'),
                (N'173', N'قسم شرطة الخارجة',N'23'),
                (N'174', N'مركز سمالوط غرب',N'19'),
                (N'175', N'مركز منفلوط',N'22'),
                (N'176', N'مركز ساحل سليم',N'22'),
                (N'177', N'مركز ديروط',N'22'),
                (N'178', N'مركز القوصية',N'22'),
                (N'179', N'مركز الفتح',N'22'),
                (N'180', N'مركز الغنايم',N'22'),
                (N'181', N'مركز البدارى',N'22'),
                (N'182', N'مركز أسيوط',N'22'),
                (N'183', N'مركز أبو تيج',N'22'),
                (N'184', N'مركز أبنوب',N'22'),
                (N'185', N'مركز صدفا',N'22'),
                (N'186', N'مركز بنى عبيد',N'11'),
                (N'187', N'مركز بلقاس',N'11'),
                (N'188', N'مركز المنصورة',N'11'),
                (N'189', N'مركز امبابه',N'3'),
                (N'190', N'مركز العياط',N'3'),
                (N'191', N'مركز الصف',N'3'),
                (N'192', N'مركز الجيزة',N'3'),
                (N'193', N'مركز البدرشين',N'3'),
                (N'194', N'مركز أوسيم',N'3'),
                (N'195', N'مركز أطفيح',N'3'),
                (N'196', N'قسم ثان 6 أكتوبر',N'3'),
                (N'197', N'قسم بولاق الدكرور',N'3'),
                (N'198', N'قسم الوراق',N'3'),
                (N'199', N'قسم الواحات البحرية',N'3'),
                (N'200', N'قسم العمرانية',N'3'),
                (N'201', N'قسم العجوزة',N'3'),
                (N'202', N'قسم الطالبية',N'3'),
                (N'203', N'قسم الشيخ زايد',N'3'),
                (N'204', N'قسم الدقى',N'3'),
                (N'205', N'قسم الحوامدية',N'3'),
                (N'206', N'قسم الجيزة',N'3'),
                (N'207', N'قسم الأهرام',N'3'),
                (N'208', N'مركز كرداسة',N'3'),
                (N'209', N'قسم أول 6 أكتوبر',N'3'),
                (N'210', N'قسم أول بنها',N'4'),
                (N'211', N'قسم الخانكة',N'4'),
                (N'212', N'قسم الدخيله',N'5'),
                (N'213', N'قسم الجمرك',N'5'),
                (N'214', N'قسم أول الرمل',N'5'),
                (N'215', N'الساحل الشمالى-جزء',N'5'),
                (N'216', N'إدارة شرطة ميناء الاسكندرية-قس',N'5'),
                (N'217', N'مركز كفر شكر',N'4'),
                (N'218', N'مركز قليوب',N'4'),
                (N'219', N'مركز طوخ',N'4'),
                (N'220', N'مركز شبين القناطر',N'4'),
                (N'221', N'مركز بنها',N'4'),
                (N'222', N'مركز القناطر الخيرية',N'4'),
                (N'223', N'مركز الخانكة',N'4'),
                (N'224', N'قسم قها',N'4'),
                (N'225', N'قسم قليوب',N'4'),
                (N'226', N'قسم ثان شبرا الخيمة',N'4'),
                (N'227', N'قسم ثان بنها',N'4'),
                (N'228', N'قسم بنها',N'4'),
                (N'229', N'قسم العبور',N'4'),
                (N'230', N'قسم الخصوص',N'4'),
                (N'231', N'قسم أول شبرا الخيمة',N'4'),
                (N'232', N'قسم أمبابة',N'3'),
                (N'233', N'قسم منشأة ناصر',N'2'),
                (N'234', N'قسم مصر القديمة',N'2'),
                (N'235', N'قسم الخليفة',N'2'),
                (N'236', N'قسم الدرب الأحمر',N'2'),
                (N'237', N'قسم الزاوية الحمراء',N'2'),
                (N'238', N'قسم الزمالك',N'2'),
                (N'239', N'قسم الزيتون',N'2'),
                (N'240', N'قسم الساحل',N'2'),
                (N'241', N'قسم السلام',N'2'),
                (N'242', N'قسم السيدة زينب',N'2'),
                (N'243', N'قسم الشرابية',N'2'),
                (N'244', N'قسم الشروق',N'2'),
                (N'245', N'قسم الظاهر',N'2'),
                (N'246', N'قسم المرج',N'2'),
                (N'247', N'قسم المطرية',N'2'),
                (N'248', N'قسم المعادى',N'2'),
                (N'249', N'قسم الموسكى',N'2'),
                (N'250', N'قسم النزهة',N'2'),
                (N'251', N'قسم الوايلى',N'2'),
                (N'252', N'قسم باب الشعرية',N'2'),
                (N'253', N'قسم بولاق',N'2'),
                (N'254', N'قسم الجمالية',N'2'),
                (N'255', N'قسم التبين',N'2'),
                (N'256', N'قسم البساتين',N'2'),
                (N'257', N'قسم الأميرية',N'2'),
                (N'258', N'قسم مصر الجديدة',N'2'),
                (N'259', N'قسم مدينة نصر أول',N'2'),
                (N'260', N'قسم مدينة بدر',N'2'),
                (N'261', N'قسم قصر النيل',N'2'),
                (N'262', N'قسم عين شمس',N'2'),
                (N'263', N'قسم عابدين',N'2'),
                (N'264', N'قسم طره',N'2'),
                (N'265', N'قسم شبرا',N'2'),
                (N'266', N'قسم روض الفرج',N'2'),
                (N'267', N'قسم العامرية',N'5'),
                (N'268', N'قسم حلوان',N'2'),
                (N'269', N'قسم ثانى مدينه نصر',N'2'),
                (N'270', N'قسم ثانى السلام (النهضة)',N'2'),
                (N'271', N'قسم ثان القاهرة الجديدة',N'2'),
                (N'272', N'فسم المعصرة',N'2'),
                (N'273', N'فسم المقطم',N'2'),
                (N'274', N'فسم دار السلام',N'2'),
                (N'275', N'قسم 15 مايو',N'2'),
                (N'276', N'قسم أول القاهرة الجديدة',N'2'),
                (N'277', N'قسم الأزبكية',N'2'),
                (N'278', N'قسم حدائق القبة',N'2'),
                (N'279', N'قسم العطارين',N'5'),
                (N'280', N'قسم اللبان',N'5'),
                (N'281', N'قسم المنتزه',N'5'),
                (N'282', N'مركز سيدى سالم',N'9'),
                (N'283', N'مركز دسوق',N'9'),
                (N'284', N'مركز بيلا',N'9'),
                (N'285', N'مركز الرياض',N'9'),
                (N'286', N'مركز الحامول',N'9'),
                (N'287', N'مركز البرلس',N'9'),
                (N'288', N'قسم دسوق',N'9'),
                (N'289', N'قسم ثان كفر الشيخ',N'9'),
                (N'290', N'قسم بيلا',N'9'),
                (N'291', N'قسم كفر الشيخ',N'9'),
                (N'292', N'مركز ومدينة السادات',N'8'),
                (N'293', N'مركز منوف',N'8'),
                (N'294', N'مركز قويسنا',N'8'),
                (N'295', N'مركز شبين الكوم',N'8'),
                (N'296', N'مركز تلا',N'8'),
                (N'297', N'مركز بركة السبع',N'8'),
                (N'298', N'مركز الشهداء',N'8'),
                (N'299', N'مركز الباجور',N'8'),
                (N'300', N'مركز أشمون',N'8'),
                (N'301', N'مركز فوه',N'9'),
                (N'302', N'مركز قلين',N'9'),
                (N'303', N'مركز كفر الشيخ',N'9'),
                (N'304', N'مركز مطوبس',N'9'),
                (N'305', N'مركز المنزلة',N'11'),
                (N'306', N'مركز المطرية',N'11'),
                (N'307', N'مركز السنبلاوين',N'11'),
                (N'308', N'مركز الجمالية',N'11'),
                (N'309', N'مركز أجا',N'11'),
                (N'310', N'قسم ميت غمر',N'11'),
                (N'311', N'قسم جمصة',N'11'),
                (N'312', N'قسم ثان المنصورة',N'11'),
                (N'313', N'قسم الكردي',N'11'),
                (N'314', N'قسم مدينة منوف',N'8'),
                (N'315', N'قسم أول المنصورة',N'11'),
                (N'316', N'مركز كفر البطيخ',N'10'),
                (N'317', N'مركز فارسكور',N'10'),
                (N'318', N'مركز دمياط',N'10'),
                (N'319', N'مركز الزرقا',N'10'),
                (N'320', N'قسم مدينة دمياط الجديدة',N'10'),
                (N'321', N'قسم رأس البر',N'10'),
                (N'322', N'قسم ثان دمياط',N'10'),
                (N'323', N'قسم أول دمياط',N'10'),
                (N'324', N'إدارة شرطة ميناء دمياط الجديد',N'10'),
                (N'325', N'مركز كفر سعد',N'10'),
                (N'326', N'مركز القرنة',N'28'),
                (N'327', N'قسم شبين الكوم',N'8'),
                (N'328', N'مركز كفر الزيات',N'7'),
                (N'329', N'مركز إتياى البارود',N'6'),
                (N'330', N'مركز أبو حمص',N'6'),
                (N'331', N'مركز أبو المطامير',N'6'),
                (N'332', N'قسم كفر الدوار',N'6'),
                (N'333', N'قسم غرب النوبارية',N'6'),
                (N'334', N'قسم دمنهور',N'6'),
                (N'335', N'مدينة برج العرب الجديدة',N'5'),
                (N'336', N'قسم مينا البصل',N'5'),
                (N'337', N'قسم محرم بك',N'5'),
                (N'338', N'قسم كرموز',N'5'),
                (N'339', N'قسم سيدى جابر',N'5'),
                (N'340', N'قسم ثانى المنتزه',N'5'),
                (N'341', N'قسم ثان العامرية',N'5'),
                (N'342', N'قسم ثان الرمل',N'5'),
                (N'343', N'قسم برج العرب',N'5'),
                (N'344', N'قسم باب شرقى',N'5'),
                (N'345', N'قسم اول المنتزه',N'5'),
                (N'346', N'قسم اول العامرية',N'5'),
                (N'347', N'قسم المنشية',N'5'),
                (N'348', N'مركز ادكو',N'6'),
                (N'349', N'مركز الدلنجات',N'6'),
                (N'350', N'مركز الرحمانية',N'6'),
                (N'351', N'مركز المحمودية',N'6'),
                (N'352', N'مركز قطور',N'7'),
                (N'353', N'مركز طنطا',N'7'),
                (N'354', N'مركز سمنود',N'7'),
                (N'355', N'مركز زفتى',N'7'),
                (N'356', N'مركز بسيون',N'7'),
                (N'357', N'مركز المحلة الكبرى',N'7'),
                (N'358', N'مركز السنطة',N'7'),
                (N'359', N'قسم ثان طنطا',N'7'),
                (N'360', N'قسم ثان المحلة الكبرى',N'7'),
                (N'361', N'قسم سرس الليانة',N'8'),
                (N'362', N'قسم ثالث المحلة الكبرى',N'7'),
                (N'363', N'قسم أول المحلة الكبرى',N'7'),
                (N'364', N'مركز وادى النطرون',N'6'),
                (N'365', N'مركز كوم حمادة',N'6'),
                (N'366', N'مركز كفر الدوار',N'6'),
                (N'367', N'مركز شبرا خيت',N'6'),
                (N'368', N'مركز رشيد',N'6'),
                (N'369', N'مركز دمنهور',N'6'),
                (N'370', N'مركز حوش عيسى',N'6'),
                (N'371', N'مركز بدر',N'6'),
                (N'372', N'قسم أول طنطا',N'7'),
                (N'373', N'مركز شرطة طيبة',N'28')


                SET IDENTITY_INSERT PoliceDepartment OFF
                ");
            }
            context.SaveChanges();
        }

        [Obsolete]
        private static void SeedGovernorates(ApplicationContext context)
        {

            if (context.Government.Count() == 0)
            {
                _ = context.Database.ExecuteSqlRaw(@"

                SET IDENTITY_INSERT Government ON

                INSERT INTO Government (Id, Name) VALUES
                (N'1', N'لم يتم تسجيله'),
                (N'2', N'القاهرة'),
                (N'3', N'الجيزة'),
                (N'4', N'القليوبية'),
                (N'5', N'الاسكندرية'),
                (N'6', N'البحيرة'),
                (N'7', N'الغربية'),
                (N'8', N'المنوفية'),
                (N'9', N'كفر الشيخ'),
                (N'10', N'دمياط'),
                (N'11', N'الدقهلية'),
                (N'12', N'الاسماعيلية'),
                (N'13', N'بورسعيد'),
                (N'14', N'السويس'),
                (N'15', N'الشرقية'),
                (N'16', N'شمال سيناء'),
                (N'17', N'جنوب سيناء'),
                (N'18', N'مرسى مطروح'),
                (N'19', N'المنيا'),
                (N'20', N'بنى سويف'),
                (N'21', N'الفيوم'),
                (N'22', N'أسيوط'),
                (N'23', N'الوادى الجديد'),
                (N'24', N'أسوان'),
                (N'25', N'سوهاج'),
                (N'26', N'قنا'),
                (N'27', N'البحر الأحمر'),
                (N'28', N'الأقصر'),
                (N'29', N'خارج الجمهورية')

                SET IDENTITY_INSERT Government OFF
                ");
            }
            context.SaveChanges();
        }

        [Obsolete]
        private static void SsedCountries(ApplicationContext context)
        {

            if (context.Country.Count() == 0)
            {
                _ = context.Database.ExecuteSqlRaw(@"

                SET IDENTITY_INSERT Country ON

               
                INSERT INTO Country (Id, Name) VALUES
                (N'1', N'لم يتم تسجيله'),
                (N'2', N'مصر'),
                (N'3', N'السعوديه'),
                (N'4', N'ليبيا'),
                (N'5', N'الجزائر'),
                (N'6', N'تونس'),
                (N'7', N'المغرب'),
                (N'8', N'موريتانيا'),
                (N'9', N'الصومال'),
                (N'10', N'جيبوتى'),
                (N'11', N'السودان'),
                (N'12', N'اليمن'),
                (N'13', N'عمان'),
                (N'14', N'الامارات العربية'),
                (N'15', N'قطر'),
                (N'16', N'البحرين'),
                (N'17', N'الكويت'),
                (N'18', N'العراق'),
                (N'19', N'الاردن'),
                (N'20', N'سوريا'),
                (N'21', N'فلسطين'),
                (N'22', N'لبنان'),
                (N'23', N'اثيوبيا'),
                (N'24', N'افريقيا الوسطى'),
                (N'25', N'اوغندا'),
                (N'26', N'تشاد'),
                (N'27', N'تنزانيا'),
                (N'28', N'الجابون'),
                (N'29', N'السنغال'),
                (N'30', N'سوازيلاند'),
                (N'31', N'سيراليون'),
                (N'32', N'غانا'),
                (N'33', N'غينيا'),
                (N'34', N'جامبيا'),
                (N'35', N'غينيا الاستوائية'),
                (N'36', N'غينيا بساو'),
                (N'37', N'فولتا العليا'),
                (N'38', N'الكونغو'),
                (N'39', N'كينيا'),
                (N'40', N'ليبريا'),
                (N'41', N'مالى'),
                (N'42', N'النيجر'),
                (N'43', N'انجولا'),
                (N'44', N'بتسوانا'),
                (N'45', N'بنين الشعبيه'),
                (N'46', N'بوروندى'),
                (N'47', N'جنوب افريقيا'),
                (N'48', N'توجو'),
                (N'49', N'رواندا'),
                (N'50', N'زامبيا'),
                (N'51', N'زيمبابوى'),
                (N'52', N'الكونجو الديمقراطيه'),
                (N'53', N'ساحل العاج'),
                (N'54', N'ساوتوس وبرنسيت'),
                (N'55', N'الكاميرون'),
                (N'56', N'جزر القمر'),
                (N'57', N'جزر الرأس الاخضر'),
                (N'58', N'ليسوتو'),
                (N'59', N'مالاوى'),
                (N'60', N'مدغشقر'),
                (N'61', N'موزمبيق'),
                (N'62', N'نامبيا'),
                (N'63', N'نيجيريا'),
                (N'64', N'افغانستان'),
                (N'65', N'اندونسيا'),
                (N'66', N'ايران'),
                (N'67', N'باكستان'),
                (N'68', N'بنجلاديش'),
                (N'69', N'بورما'),
                (N'70', N'تايلاند'),
                (N'71', N'تركيا'),
                (N'72', N'تيمور'),
                (N'73', N'سريلانكا'),
                (N'74', N'سنغافوره'),
                (N'75', N'الصين الشعبيه'),
                (N'76', N'الفلبين'),
                (N'77', N'فيتنام الجنوبيه'),
                (N'78', N'فيتنام الشماليه'),
                (N'79', N'قبرص'),
                (N'80', N'كشمير'),
                (N'81', N'كمبوديا'),
                (N'82', N'كوريا الجنوبيه'),
                (N'83', N'كوريا الشماليه'),
                (N'84', N'ماليزيا'),
                (N'85', N'مالديف'),
                (N'86', N'نيبال'),
                (N'87', N'منغوليا'),
                (N'88', N'الهند'),
                (N'89', N'روسيا'),
                (N'90', N'اسبانيا'),
                (N'91', N'البانيا'),
                (N'92', N'اندورا'),
                (N'93', N'ايرلندا'),
                (N'94', N'البرتغال'),
                (N'95', N'بولندا'),
                (N'96', N'الدنمارك'),
                (N'97', N'رومانيا'),
                (N'98', N'السويد'),
                (N'99', N'فرنسا'),
                (N'100', N'سلوفينيا'),
                (N'101', N'مالطه'),
                (N'102', N'موناكو'),
                (N'103', N'النرويج'),
                (N'104', N'سويسرا'),
                (N'105', N'صربيا'),
                (N'106', N'سلوفاكيا'),
                (N'107', N'بنما'),
                (N'108', N'جاميكا'),
                (N'109', N'دومنيكان'),
                (N'110', N'كندا'),
                (N'111', N'كوبا'),
                (N'112', N'نيكارجوا'),
                (N'113', N'جواتيمالا'),
                (N'114', N'جرنيادا'),
                (N'115', N'الارجنتين'),
                (N'116', N'اكوادور'),
                (N'117', N'بارجواى'),
                (N'118', N'بوليفيا'),
                (N'119', N'شيلى'),
                (N'120', N'جويانا'),
                (N'121', N'سورينام'),
                (N'122', N'استراليا'),
                (N'123', N'بابوا'),
                (N'124', N'فيجى'),
                (N'125', N'هونج كونج'),
                (N'126', N'اليابان'),
                (N'127', N'المانيا'),
                (N'128', N'اوكرانيا'),
                (N'129', N'ايسلندا'),
                (N'130', N'ايطاليا'),
                (N'131', N'بلجيكا'),
                (N'132', N'بلغاريا'),
                (N'133', N'جمهوريه التشيك'),
                (N'134', N'سان مارينو'),
                (N'135', N'الفاتيكان'),
                (N'136', N'فنلندا'),
                (N'137', N'لكسمبورج'),
                (N'138', N'المجر'),
                (N'139', N'انجلترا'),
                (N'140', N'النمسا'),
                (N'141', N'هولندا'),
                (N'142', N'اليونان'),
                (N'143', N'كرواتيا'),
                (N'144', N'البوسنه'),
                (N'145', N'الجبل الاسود'),
                (N'146', N'بربادوس'),
                (N'147', N'بهاما'),
                (N'148', N'بورتوريكو'),
                (N'149', N'السلفادور'),
                (N'150', N'كوستاريكا'),
                (N'151', N'المكسيك'),
                (N'152', N'هايتى'),
                (N'153', N'هندوراس'),
                (N'155', N'اورجواى'),
                (N'156', N'البرازيل'),
                (N'157', N'بيرو'),
                (N'158', N'تراندر وتوباجو'),
                (N'159', N'كولومبيا'),
                (N'160', N'نيوزيلاند'),
                (N'161', N'جزر نيوبريتين'),
                (N'162', N'فنزويلا'),
                (N'163', N'اذربيجان'),
                (N'164', N'غير متاح'),
                (N'165', N'موريشيوس'),
                (N'166', N'بروناى'),
                (N'167', N'اسرائيل'),
                (N'168', N'دوليه'),
                (N'169', N'كازاخستان'),
                (N'170', N'اريتريا'),
                (N'171', N'بواخر اجنبية'),
                (N'172', N'تركمنستان'),
                (N'173', N'باشكورستان'),
                (N'174', N'جزر ماريان'),
                (N'175', N'تايوان'),
                (N'176', N'اوزباكستان'),
                (N'177', N'بوركينا فاسو'),
                (N'178', N'طاجكستان'),
                (N'179', N'قاراقستان'),
                (N'180', N'جورجيا'),
                (N'183', N'جزر برمودا'),
                (N'182', N'سيشل'),
                (N'184', N'زنزبار'),
                (N'185', N'ملدوفيا'),
                (N'186', N'اسكوتلاندا'),
                (N'187', N'ليتوانيا'),
                (N'188', N'قرقيزيا'),
                (N'189', N'بريتوريا'),
                (N'190', N'كوسوفا'),
                (N'191', N'سانت فنسنت'),
                (N'192', N'بيلا روسيا'),
                (N'193', N'قرقستان'),
                (N'194', N'كردستان'),
                (N'195', N'لاتفيا'),
                (N'196', N'استونيا'),
                (N'197', N'بليز'),
                (N'198', N'جويانا'),
                (N'199', N'ارمنيا')


                SET IDENTITY_INSERT Country OFF
                ");
            }
            context.SaveChanges();
        }

        [Obsolete]
        private static void SsedBranches(ApplicationContext context)
        {
            if (context.Branches.Count() == 0)
            {
                context.Database.ExecuteSqlRaw($"DBCC CHECKIDENT('Branches', RESEED, 1);");
                context.Branches.Add(new Branches() { Name = "الفرع الرئيسي", Address = "......", Number = "0233333333", Version2 = true });
                context.SaveChanges();

            }
            context.SaveChanges();
        }


        [Obsolete]
        private static void SeedJobsInEgypt(ApplicationContext context)
        {
            if (context.JobsInEgypt.Count() == 0)
            {
                context.Database.ExecuteSqlRaw(@"

                SET IDENTITY_INSERT JobsInEgypt ON

                INSERT INTO JobsInEgypt (Id, JobTitle) VALUES
                (N'1', N'موظف حكومى'),
                (N'2', N'موظف قطاع خاص / حر')
                
                SET IDENTITY_INSERT JobsInEgypt OFF
                ");
            }
            context.SaveChanges();
        }



        [Obsolete]
        private static void SeedContractDescriptionTypes(ApplicationContext context)
        {
            if (context.ContractDescriptionTypes.Count() == 0)
            {
                context.Database.ExecuteSqlRaw(@"

                SET IDENTITY_INSERT ContractDescriptionTypes ON

                INSERT INTO ContractDescriptionTypes (Id, Name) VALUES
                (N'1', N'شخصى'),
                (N'2', N'إعارة')
                
                SET IDENTITY_INSERT ContractDescriptionTypes OFF
                ");
            }
            context.SaveChanges();
        }

    }
}
